Конфигурация отчетов/Documents/АктРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РегистрацияРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаЗадачу</Name>
							<Type>
								<v8:Type>cfg:TaskRef.РабочиеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Невыполненые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef.РабочиеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запланировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/АктРабот/Ext/ManagerModule.bsl
Функция СоздатьАктРабот(ДатаАкта, Ответственный) Экспорт 
	
	АктРабот = Документы.АктРабот.СоздатьДокумент();
	АктРабот.Дата = ДатаАкта;
	АктРабот.Ответственный = Справочники.Заведения.ПолучитьЗаведение(Ответственный);
	АктРабот.Записать();
	Сообщить("Успешно создан новый акт работа за " + Строка(ДатаАкта) + " - " + Ответственный.Наименование + "!");
	
	Возврат АктРабот.Ссылка;
	
КонецФункции

Функция ДобавитЗаписьВАктРабот(СсылкаНаАктРабот, СсылкаНаЗадачу) Экспорт 
	
	АктРабот = СсылкаНаАктРабот.ПолучитьОбъект();
	НоваяЗадача = АктРабот.ТЧ.НоваяСтрока();
	АктРабот.Записать();
	
КонецФункции

Функция СсылкаНаАктРабот(ДатаАкта, Ответственный) Экспорт 
	
	//найти документ акта
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктРабот.Дата КАК Дата,
		|	АктРабот.Ответственный КАК Ответственный,
		|	АктРабот.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АктРабот КАК АктРабот
		|ГДЕ
		|	АктРабот.Дата = &Дата
		|	И АктРабот.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Дата", ДатаАкта);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;	
	КонецЦикла;

	
КонецФункции
